[
  {
    "text": "В мешке лежат 30 красных, 25 синих и 20 зеленых шариков. Найдите вероятность того, что наугад выбранный шарик будет синим.",
    "rules": ["Количество благоприятных исходов", "Вероятность события"],
    "rules_id": [5, 1]
  },
  {
    "text": "Игроки команды по баскетболу имеют равные шансы на победу в матче. Найдите вероятность того, что команда выиграет матч, если вероятность победы составляет 2/5.",
    "rules": ["Вероятность равновозможных событий"],
    "rules_id": [3]
  },
  {
    "text": "В городе есть 25 ресторанов, из них 10 ресторанов имеют 5-звездочный рейтинг. Найдите вероятность того, что случайно выбранный ресторан имеет 5-звездочный рейтинг.",
    "rules": ["Количество благоприятных исходов", "Вероятность события"],
    "rules_id": [5, 1]
  },
  {
    "text": "Вероятность того, что завтра будет дождь, равна 0,8. Найдите вероятность того, что завтра будет солнечно.",
    "rules": ["Сумма вероятностей противоположных событий"],
    "rules_id": [2]
  },
  {
    "text": "В мешке лежат 25 красных, 20 синих и 15 зеленых шариков. Найдите вероятность того, что наугад выбранный шарик будет красным.",
    "rules": ["Количество благоприятных исходов", "Вероятность события"],
    "rules_id": [5, 1]
  },
  {
    "text": "Игроки команды по футболу имеют равные шансы на победу в матче. Найдите вероятность того, что команда выиграет матч, если вероятность победы составляет 3/5.",
    "rules": ["Вероятность равновозможных событий"],
    "rules_id": [3]
  },
  {
    "text": "В городе есть 20 кинотеатров, из них 8 кинотеатров показывают фильм, который Вы хотите посмотреть. Найдите вероятность того, что случайно выбранный кинотеатр показывает фильм, который Вы хотите посмотреть.",
    "rules": ["Количество благоприятных исходов", "Вероятность события"],
    "rules_id": [5, 1]
  },
  {
    "text": "Вероятность того, что завтра будет облачно, равна 0,7. Найдите вероятность того, что завтра будет солнечно.",
    "rules": ["Сумма вероятностей противоположных событий"],
    "rules_id": [2]
  },
  {
    "text": "В мешке лежат 30 красных, 25 синих и 20 зеленых шариков. Найдите вероятность того, что наугад выбранный шарик будет синим.",
    "rules": ["Количество благоприятных исходов", "Вероятность события"],
    "rules_id": [5, 1]
  },
  {
    "text": "Игроки команды по баскетболу имеют равные шансы на победу в матче. Найдите вероятность того, что команда выиграет матч, если вероятность победы составляет 2/5.",
    "rules": ["Вероятность равновозможных событий"],
    "rules_id": [3]
  },
  {
    "text": "В городе есть 25 ресторанов, из них 10 ресторанов имеют 5-звездочный рейтинг. Найдите вероятность того, что случайно выбранный ресторан имеет 5-звездочный рейтинг.",
    "rules": ["Количество благоприятных исходов", "Вероятность события"],
    "rules_id": [5, 1]
  },
  {
    "text": "Последовательность чисел 2, 6, 18, 54,... образует геометрическую прогрессию. Найдите следующий член последовательности.",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Последовательность чисел 1, 4, 7, 10,... образует арифметическую прогрессию. Найдите следующий член последовательности.",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "Диаметры четырех колец, насаженных на общий вал, образуют арифметическую прогрессию. Сумма диаметров первого и третьего колец составляет 24 см, а второго и четвертого — 30 см. Сколько сантиметров составляет диаметр наибольшего кольца?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "Последовательность чисел 3, 9, 27, 81,... образует геометрическую прогрессию. Найдите следующий член последовательности.",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Однажды купец заключил сделку с человеком, который в течение 10 дней ежедневно должен был приносить по 500 р., а взамен в первый день купец должен был отдать 5 р., во второй — 10 р., в третий — 20 р., в четвертый — 40 р. и т. д. в течение 10 дней. Сколько денег получил купец и сколько он отдал?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Последовательность чисел 2, 5, 8, 11,... образует арифметическую прогрессию. Найдите следующий член последовательности.",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "Диаметры трех колец, насаженных на общий вал, образуют арифметическую прогрессию. Сумма диаметров первого и третьего колец составляет 20 см, а второго и третьего — 24 см. Сколько сантиметров составляет диаметр наибольшего кольца?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "Последовательность чисел 4, 16, 64, 256,... образует геометрическую прогрессию. Найдите следующий член последовательности.",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Компания «Альфа» начала инвестировать средства в перспективную отрасль в 2001 году, имея капитал в размере 3000 долларов. Каждый год, начиная с 2002 года, она получала прибыль, которая составляла 80% от капитала предыдущего года. А компания «Бета» начала инвестировать средства в другую отрасль в 2004 году, имея капитал в размере 3500 долларов, и, начиная с 2005 года, ежегодно получала прибыль, составляющую 150% от капитала предыдущего года. На сколько долларов капитал одной из компаний был больше капитала другой к концу 2007 года, если прибыль из оборота не изымалась?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "За изготовление и установку нижнего железобетонного кольца колодца заплатили 210 рублей, а за каждое следующее кольцо платили на 15 рублей меньше, чем за предыдущее. Кроме того, по окончании работы была выплачена премия 300 рублей. Средняя стоимость изготовления и установки одного кольца с учетом премии оказалась равна 195 рублей. Сколько колец было установлено?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В амфитеатре 12 рядов. В первом ряду 20 мест, а в каждом следующем на 2 места больше, чем в предыдущем. Сколько мест в девятом ряду амфитеатра?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В результате трехкратного повышения цены на некоторый товар на одно и то же число процентов цена товара стала превышать первоначальную цену на 64,8%. На сколько процентов повышалась цена на товар каждый раз?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Каждый день больной заражает трех человек, каждый из которых, начиная со следующего дня, каждый день также заражает новых трех и так далее. Болезнь длится 14 дней. В первый день месяца в город N приехал заболевший гражданин К, и в это же день он заразил трех человек. В какой день станет 2187 заболевших?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Компания «Альфа» начала инвестировать средства в перспективную отрасль в 2001 году, имея капитал в размере 2500 долларов. Каждый год, начиная с 2002 года, она получала прибыль, которая составляла 70% от капитала предыдущего года. А компания «Бета» начала инвестировать средства в другую отрасль в 2004 году, имея капитал в размере 3000 долларов, и, начиная с 2005 года, ежегодно получала прибыль, составляющую 120% от капитала предыдущего года. На сколько долларов капитал одной из компаний был больше капитала другой к концу 2007 года, если прибыль из оборота не изымалась?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "За изготовление и установку нижнего железобетонного кольца колодца заплатили 240 рублей, а за каждое следующее кольцо платили на 12 рублей меньше, чем за предыдущее. Кроме того, по окончании работы была выплачена премия 320 рублей. Средняя стоимость изготовления и установки одного кольца с учетом премии оказалась равна 220 рублей. Сколько колец было установлено?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В амфитеатре 15 рядов. В первом ряду 25 мест, а в каждом следующем на 1 место больше, чем в предыдущем. Сколько мест в четырнадцатом ряду амфитеатра?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В результате трехкратного повышения цены на некоторый товар на одно и то же число процентов цена товара стала превышать первоначальную цену на 59,4%. На сколько процентов повышалась цена на товар каждый раз?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Каждый день больной заражает двух человек, каждый из которых, начиная со следующего дня, каждый день также заражает новых двух и так далее. Болезнь длится 14 дней. В первый день месяца в город N приехал заболевший гражданин К, и в это же день он заразил двух человек. В какой день станет 2048 заболевших?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Компания «Альфа» начала инвестировать средства в перспективную отрасль в 2001 году, имея капитал в размере 2000 долларов. Каждый год, начиная с 2002 года, она получала прибыль, которая составляла 60% от капитала предыдущего года. А компания «Бета» начала инвестировать средства в другую отрасль в 2004 году, имея капитал в размере 2500 долларов, и, начиная с 2005 года, ежегодно получала прибыль, составляющую 100% от капитала предыдущего года. На сколько долларов капитал одной из компаний был больше капитала другой к концу 2007 года, если прибыль из оборота не изымалась?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "За изготовление и установку нижнего железобетонного кольца колодца заплатили 260 рублей, а за каждое следующее кольцо платили на 10 рублей меньше, чем за предыдущее. Кроме того, по окончании работы была выплачена премия 280 рублей. Средняя стоимость изготовления и установки одного кольца с учетом премии оказалась равна 230 рублей. Сколько колец было установлено?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В амфитеатре 18 рядов. В первом ряду 20 мест, а в каждом следующем на 2 места больше, чем в предыдущем. Сколько мест в семнадцатом ряду амфитеатра?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В результате трехкратного повышения цены на некоторый товар на одно и то же число процентов цена товара стала превышать первоначальную цену на 54,8%. На сколько процентов повышалась цена на товар каждый раз?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Каждый день больной заражает трех человек, каждый из которых, начиная со следующего дня, каждый день также заражает новых трех и так далее. Болезнь длится 14 дней. В первый день месяца в город N приехал заболевший гражданин К, и в это же день он заразил трех человек. В какой день станет 6561 заболевших?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "Компания «Альфа» начала инвестировать средства в перспективную отрасль в 2001 году, имея капитал в размере 1500 долларов. Каждый год, начиная с 2002 года, она получала прибыль, которая составляла 50% от капитала предыдущего года. А компания «Бета» начала инвестировать средства в другую отрасль в 2004 году, имея капитал в размере 2000 долларов, и, начиная с 2005 года, ежегодно получала прибыль, составляющую 80% от капитала предыдущего года. На сколько долларов капитал одной из компаний был больше капитала другой к концу 2007 года, если прибыль из оборота не изымалась?",
    "rules": ["Геометрическая прогрессия"],
    "rules_id": [7]
  },
  {
    "text": "За изготовление и установку нижнего железобетонного кольца колодца заплатили 270 рублей, а за каждое следующее кольцо платили на 8 рублей меньше, чем за предыдущее. Кроме того, по окончании работы была выплачена премия 240 рублей. Средняя стоимость изготовления и установки одного кольца с учетом премии оказалась равна 250 рублей. Сколько колец было установлено?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  },
  {
    "text": "В амфитеатре 20 рядов. В первом ряду 25 мест, а в каждом следующем на 1 место больше, чем в предыдущем. Сколько мест в девятнадцатом ряду амфитеатра?",
    "rules": ["Арифметическая прогрессия"],
    "rules_id": [6]
  }
]